FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32Hxx/NetworkInterface.c
static void vClearOptionBit( volatile uint32_t * pulValue,
                             uint32_t ulValue );

static size_t uxGetOwnCount( ETH_HandleTypeDef * heth );

/* FreeRTOS+TCP/multi :
 * Each network device has 3 access functions:
 * - Initialise the device
 * - Output a network packet
 * - Return the PHY Link-Status (LS)
 * They can be defined as static because the function addresses
 * addresses will be stored in struct NetworkInterface_t. */

static BaseType_t xSTM32H_NetworkInterfaceInitialise( NetworkInterface_t * pxInterface );

static BaseType_t xSTM32H_NetworkInterfaceOutput( NetworkInterface_t * pxInterface,
                                                  NetworkBufferDescriptor_t * const pxBuffer,
                                                  BaseType_t xReleaseAfterSend );

static BaseType_t xSTM32H_GetPhyLinkStatus( NetworkInterface_t * pxInterface );

NetworkInterface_t * pxSTM32H_FillInterfaceDescriptor( BaseType_t xEMACIndex,
                                                       NetworkInterface_t * pxInterface );
/*-----------------------------------------------------------*/

static EthernetPhy_t xPhyObject;
/* For local use only: describe the PHY's properties: */
const PhyProperties_t xPHYProperties =
{
    .ucSpeed  = PHY_SPEED_AUTO,
    .ucDuplex = PHY_DUPLEX_AUTO,
    .ucMDI_X  = PHY_MDIX_DIRECT
};
/*-----------------------------------------------------------*/

static uint32_t prvRevBits32(uint32_t ulValue)
{
    uint32_t ulRev32;
    int iIndex;
 
    ulRev32 = 0;
 
    for(iIndex=0; iIndex<32; iIndex++)
    {
        if (ulValue & (1 << iIndex))
        {
            {
                ulRev32 |= 1 << (31 - iIndex);
            }
        }
    }
    
    return ulRev32;

}

static uint32_t prvComputeCRC32_MAC(const uint8_t *pucMAC) 
{
    int iiIndex, ijIndex;
    uint32_t ulCRC32 = 0xFFFFFFFF;
 
    for(ijIndex=0; ijIndex<6; ijIndex++)
    {
        ulCRC32 = ulCRC32 ^ (uint32_t)pucMAC[ijIndex];
 
        for(iiIndex=0; iiIndex<8; iiIndex++)
        {
            if (ulCRC32 & 1)
            {
                ulCRC32 = (ulCRC32 >> 1) ^ prvRevBits32(0x04C11DB7); /* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
            }
            else
            {
                ulCRC32 = (ulCRC32 >> 1);
            }
        }
    }

    ulCRC32 = ~(ulCRC32);
    return ulCRC32;

}

static uint32_t prvComputeEthernet_MACHash(const uint8_t *pucMAC) 
{
    uint32_t ulCRC32;
    uint32_t ulHash;
    
    ulCRC32 = prvComputeCRC32_MAC(pucMAC);
    ulHash = prvRevBits32(ulCRC32);

    return (ulHash >> 26);
}

static void prvSetMulitcastMAC_HashFilter(ETH_HandleTypeDef * pxEthHandle, const uint8_t *pucMAC)
{
    uint32_t ulHash;
    ulHash = prvComputeEthernet_MACHash(pucMAC);

	if (ulHash < 32) 
    {
        pxEthHandle->Instance->MACHT0R |= (1 << ulHash);
	} else 
    {
        pxEthHandle->Instance->MACHT1R |= (1 << (ulHash % 32));
	}
}

/*-----------------------------------------------------------*/


/*******************************************************************************
*                      Network Interface API Functions
*******************************************************************************/

static uint8_t * pucGetRXBuffer( size_t uxSize )
{
    TickType_t uxBlockTimeTicks = ipMS_TO_MIN_TICKS( 10U );
    NetworkBufferDescriptor_t * pxBufferDescriptor;
    uint8_t * pucReturn = NULL;

    pxBufferDescriptor = pxGetNetworkBufferWithDescriptor( uxSize, uxBlockTimeTicks );

    if( pxBufferDescriptor != NULL )
    {
        pucReturn = pxBufferDescriptor->pucEthernetBuffer;
    }

    return pucReturn;
}
/*-----------------------------------------------------------*/

static BaseType_t xSTM32H_NetworkInterfaceInitialise( NetworkInterface_t * pxInterface )
{
    BaseType_t xResult;
    NetworkEndPoint_t * pxEndPoint;
    HAL_StatusTypeDef xHalEthInitStatus;
    size_t uxIndex = 0;

    if( xMacInitStatus == eMACInit )
    {
        pxMyInterface = pxInterface;

        pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
        configASSERT( pxEndPoint != NULL );

        /*
         * Initialize ETH Handler
         * It assumes that Ethernet GPIO and clock configuration
         * are already done in the ETH_MspInit()
         */
        xEthHandle.Instance = ETH;
        xEthHandle.Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;
        xEthHandle.Init.MediaInterface = HAL_ETH_RMII_MODE;
        xEthHandle.Init.TxDesc = DMATxDscrTab;
        xEthHandle.Init.RxDesc = DMARxDscrTab;
        xEthHandle.Init.RxBuffLen = ( ETH_RX_BUF_SIZE - ipBUFFER_PADDING ) & ~( ( uint32_t ) 3U );

        /* Make sure that all unused fields are cleared. */
        memset( &( DMATxDscrTab ), '\0', sizeof( DMATxDscrTab ) );
        memset( &( DMARxDscrTab ), '\0', sizeof( DMARxDscrTab ) );

        xHalEthInitStatus = HAL_ETH_Init( &( xEthHandle ) );

        /* Only for inspection by debugger. */
        ( void ) xHalEthInitStatus;

        /* Update MAC filter settings */
        xEthHandle.Instance->MACPFR |= ENABLE_MULTICAST_HASH_FILTER;

        /* Configuration for HAL_ETH_Transmit(_IT). */
        memset( &( xTxConfig ), 0, sizeof( ETH_TxPacketConfig ) );
        xTxConfig.Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD;

        #if ( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM != 0 )
            {
                /*xTxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC; */
                xTxConfig.Attributes |= ETH_TX_PACKETS_FEATURES_CSUM;
                xTxConfig.ChecksumCtrl = ETH_DMATXNDESCRF_CIC_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
            }
        #else
            {
                xTxConfig.ChecksumCtrl = ETH_CHECKSUM_DISABLE;
            }
        #endif
        xTxConfig.CRCPadCtrl = ETH_CRC_PAD_INSERT;

        /* This counting semaphore will count the number of free TX DMA descriptors. */
        xTXDescriptorSemaphore = xSemaphoreCreateCounting( ( UBaseType_t ) ETH_TX_DESC_CNT, ( UBaseType_t ) ETH_TX_DESC_CNT );
        configASSERT( xTXDescriptorSemaphore );

        xTransmissionMutex = xSemaphoreCreateMutex();
        configASSERT( xTransmissionMutex );

        /* Assign Rx memory buffers to a DMA Rx descriptor */
        for( uxIndex = 0; uxIndex < ETH_RX_DESC_CNT; uxIndex++ )
        {
            uint8_t * pucBuffer;

            #if ( ipconfigZERO_COPY_RX_DRIVER != 0 )
                {
                    pucBuffer = pucGetRXBuffer( ETH_RX_BUF_SIZE );
                    configASSERT( pucBuffer != NULL );
                }
            #else
                {
                    pucBuffer = Rx_Buff[ uxIndex ];
                }
            #endif

            HAL_ETH_DescAssignMemory( &( xEthHandle ), uxIndex, pucBuffer, NULL );
        }

